Repository: pingfangx/TranslatorX-other
Catalog: JavaDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: That is, a queue does not keep track of the references that are registered with it.
zh_cn: 也就是说，队列不会追踪那些向它注册的引用。

source: The "Concurrent" prefix used with some classes in this package is a shorthand indicating several differences from similar "synchronized" classes.
zh_cn: 此包中与某些类一起使用的 "Concurrent" 前缀是一种简写，表明与类似的“synchronized”类有所不同。

source: The "standard" error output stream.
zh_cn: “标准”错误输出流。

source: The "standard" input stream.
zh_cn: “标准”输入流。

source: The "standard" output stream.
zh_cn: “标准”输出流。

source: The "target exception" that is provided at construction time and accessed via the getTargetException() method is now known as the cause, and may be accessed via the getCause() method, as well as the aforementioned "legacy method."
zh_cn: “目标异常”是在构造的时候提供的，可以通过 getTargetException() 方法访问，这类对象目前被认为是导致异常的原因，可以通过 getCause() 方法以及前面提到的“遗留方法”访问它。

source: The "undeclared checked exception that was thrown by the invocation handler" that may be provided at construction time and accessed via the getUndeclaredThrowable() method is now known as the cause, and may be accessed via the getCause() method, as well as the aforementioned "legacy method."
zh_cn: “由调用处理程序抛出的经过检查的未声明异常”可以在构造的时候提供，并且可以通过 getUndeclaredThrowable() 方法访问，这类对象目前被认为是导致异常的原因，可以通过 getCause() 方法以及前面提到的“遗留方法”访问它。

source: The #containsKey containsKey operation may be used to distinguish these two cases.
zh_cn: #containsKey containsKey 操作可用于区分这两种情况。

source: The TooManyListenersException Exception is used as part of the Java Event model to annotate and implement a unicast special case of a multicast Event Source.
zh_cn: TooManyListenersException 异常用作 Java Event 模型的一部分来注释和实现多播 Event Source 的单播特例。

source: The AbstractQueuedSynchronizer class serves as a useful superclass for defining locks and other synchronizers that rely on queuing blocked threads.
zh_cn: AbstractQueuedSynchronizer 类是一个非常有用的超类，可用来定义锁以及依赖于排队阻塞线程的其他同步器。

source: The AtomicIntegerArray, AtomicLongArray, and AtomicReferenceArray classes further extend atomic operation support to arrays of these types.
zh_cn: AtomicIntegerArray、AtomicLongArray 和 AtomicReferenceArray 类进一步扩展了原子操作，对这些类型的数组提供了支持。

source: The AtomicMarkableReference class associates a single boolean with a reference.
zh_cn: AtomicMarkableReference 类将单个布尔值与引用关联起来。

source: The BlockingDeque interface extends BlockingQueue to support both FIFO and LIFO (stack-based) operations.
zh_cn: BlockingDeque 接口扩展 BlockingQueue，以支持 FIFO 和 LIFO（基于堆栈）操作。

source: The ConcurrentLinkedQueue class supplies an efficient scalable thread-safe non-blocking FIFO queue.
zh_cn: ConcurrentLinkedQueue 类提供了高效的、可伸缩的、线程安全的非阻塞 FIFO 队列。

source: The Condition interface describes condition variables that may be associated with Locks.
zh_cn: Condition 接口描述了可能会与锁有关联的条件变量。

source: The InetAddress class is the abstraction representing an IP (Internet Protocol) address.
zh_cn: InetAddress 类是表示 IP（Internet 协议）地址的抽象。

source: The Lock interface supports locking disciplines that differ in semantics (reentrant, fair, etc), and that can be used in non-block-structured contexts including hand-over-hand and lock reordering algorithms.
zh_cn: Lock 接口支持那些语义不同（重入、公平等）的锁规则，可以在非阻塞式结构的上下文（包括 hand-over-hand 和锁重排算法）中使用这些规则。

source: The NetworkInterface class provides APIs to browse and query all the networking interfaces (e.g. ethernet connection or PPP endpoint) of the local machine.
zh_cn: NetworkInterface 类提供 API 以浏览和查询本地机器的所有网络接口（例如，以太网连接或 PPP 端点）。

source: The Proxy.isProxyClass method will return true if it is passed a proxy class-- a class returned by Proxy.getProxyClass or the class of an object returned by Proxy.newProxyInstance-- and false otherwise.
zh_cn: 如果 Proxy.isProxyClass 方法传递代理类（由 Proxy.getProxyClass 返回的类，或由 Proxy.newProxyInstance 返回的对象的类），则该方法返回 true，否则返回 false。

source: The ReadWriteLock interface similarly defines locks that may be shared among readers but are exclusive to writers.
zh_cn: ReadWriteLock 接口以类似方式定义了一些读取者可以共享而写入者独占的锁。

source: The TimeUnit class provides multiple granularities (including nanoseconds) for specifying and controlling time-out based operations.
zh_cn: TimeUnit 类为指定和控制基于超时的操作提供了多重粒度（包括纳秒级）。

source: The getCause() method is now the preferred means of obtaining this information.
zh_cn: getCause() 方法现在是获得此信息的首选方法。

source: The start() and Runtime.exec methods create a native process and return an instance of a subclass of Process that can be used to control the process and obtain information about it.
zh_cn: start() 和 Runtime.exec 方法创建一个本机进程，并返回 Process 子类的一个实例，该实例可用来控制进程并获得相关信息。

source: The AlgorithmParameterGenerator class is used to generate a set of parameters to be used with a certain algorithm.
zh_cn: AlgorithmParameterGenerator 类用于生成将在某个特定算法中使用的参数集合。

source: The Array class provides static methods to dynamically create and access Java arrays.
zh_cn: Array 类提供了动态创建和访问 Java 数组的方法。

source: The Boolean object corresponding to the primitive value false.
zh_cn: 对应基值 false 的 Boolean 对象。

source: The Boolean object corresponding to the primitive value true.
zh_cn: 对应基值 true 的 Boolean 对象。

source: The BreakIterator class implements methods for finding the location of boundaries in text.
zh_cn: BreakIterator 类实现用于查找文本中边界位置的方法。

source: The Byte class wraps a value of primitive type byte in an object.
zh_cn: Byte 类将基本类型 byte 的值包装在一个对象中。

source: The Calendar class is an abstract class that provides methods for converting between a specific instant in time and a set of calendar fields such as YEAR, MONTH, DAY_OF_MONTH, HOUR, and so on, and for manipulating the calendar fields, such as getting the date of the next week.
zh_cn: Calendar 类是一个抽象类，它为特定瞬间与一组诸如 YEAR, 、 MONTH 、 DAY_OF_MONTH 、 HOUR 等 日历字段 之间的转换提供了一些方法，并为操作日历字段（例如获得下星期的日期）提供了一些方法。

source: The Character class wraps a value of the primitive type char in an object.
zh_cn: Character 类在对象中包装一个基本类型 char 的值。

source: The Class instance representing the primitive type byte.
zh_cn: 表示基本类型 byte 的 Class 实例。

source: The Class instance representing the primitive type char.
zh_cn: 表示基本类型 char 的 Class 实例。

source: The Class instance representing the primitive type double.
zh_cn: 表示基本类型 double 的 Class 实例。

source: The Class instance representing the primitive type float.
zh_cn: 表示 float 基本类型的 Class 实例。

source: The Class instance representing the primitive type int.
zh_cn: 表示基本类型 int 的 Class 实例。

source: The Class instance representing the primitive type long.
zh_cn: 表示基本类型 long 的 Class 实例。

source: The Class instance representing the primitive type short.
zh_cn: 表示基本类型 short 的 Class 实例。

source: The Class object representing the pseudo-type corresponding to the keyword void.
zh_cn: 表示对应于关键字 void 的伪类型的 Class 对象。

source: The CollationElementIterator class is used as an iterator to walk through each character of an international string.
zh_cn: CollationElementIterator 类用作一个迭代器，以遍历国际化字符串的每个字符。

source: The Collator class performs locale-sensitive String comparison.
zh_cn: Collator 类执行区分语言环境的 String 比较。

source: The DataInput interface provides for reading bytes from a binary stream and reconstructing from them data in any of the Java primitive types.
zh_cn: DataInput 接口用于从二进制流中读取字节，并根据所有 Java 基本类型数据进行重构。

source: The DataOutput interface provides for converting data from any of the Java primitive types to a series of bytes and writing these bytes to a binary stream.
zh_cn: DataOutput 接口用于将数据从任意 Java 基本类型转换为一系列字节，并将这些字节写入二进制流。

source: The Dictionary class is the abstract parent of any class, such as Hashtable, which maps keys to values.
zh_cn: Dictionary 类是任何可将键映射到相应值的类（如 Hashtable ）的抽象父类。

source: The Double class wraps a value of the primitive type double in an object.
zh_cn: Double 类在对象中包装一个基本类型 double 的值。

source: The Float class wraps a value of primitive type float in an object.
zh_cn: Float 类在对象中包装一个基本类型 float 的值。

source: The GeneralSecurityException class is a generic security exception class that provides type safety for all the security-related exception classes that extend from it.
zh_cn: GeneralSecurityException 类是一个一般安全异常类，可以为所有从其扩展的与安全有关的异常类提供类型安全。

source: The Integer class wraps a value of the primitive type int in an object.
zh_cn: Integer 类在对象中包装了一个基本类型 int 的值。

source: The Long class wraps a value of the primitive type long in an object.
zh_cn: Long 类在对象中包装了基本类型 long 的值。

source: The Properties class represents a persistent set of properties.
zh_cn: Properties 类表示了一个持久的属性集。

source: The RuleBasedCollator class is a concrete subclass of Collator that provides a simple, data-driven, table collator.
zh_cn: RuleBasedCollator 类是 Collator 的具体子类，它提供了一个简单的、数据驱动的表 collator。

source: The Runnable interface should be implemented by any class whose instances are intended to be executed by a thread.
zh_cn: Runnable 接口应该由那些打算通过某一线程执行其实例的类来实现。

source: The Short class wraps a value of primitive type short in an object.
zh_cn: Short 类在对象中包装基本类型 short 的值。

source: The Stack class represents a last-in-first-out (LIFO) stack of objects.
zh_cn: Stack 类表示后进先出（LIFO）的对象堆栈。

source: The StreamTokenizer class takes an input stream and parses it into "tokens", allowing the tokens to be read one at a time.
zh_cn: StreamTokenizer 类获取输入流并将其解析为“标记”，允许一次读取一个标记。

source: The String class provides methods for dealing with Unicode code points (i.e., characters), in addition to those for dealing with Unicode code units (i.e., char values).
zh_cn: String 类提供处理 Unicode 代码点（即字符）和 Unicode 代码单元（即 char 值）的方法。

source: The String class represents character strings.
zh_cn: String 类代表字符串。

source: The System class contains several useful class fields and methods.
zh_cn: System 类包含一些有用的类字段和方法。

source: The Throwable class is the superclass of all errors and exceptions in the Java language.
zh_cn: Throwable 类是 Java 语言中所有错误或异常的超类。

source: The Vector class implements a growable array of objects.
zh_cn: Vector 类可以实现可增长的对象数组。

source: The Void class is an uninstantiable placeholder class to hold a reference to the Class object representing the Java keyword void.
zh_cn: Void 类是一个不可实例化的占位符类，它持有对表示 Java 关键字 void 的 Class 对象的引用。

source: The char data type (and therefore the value that a Character object encapsulates) are based on the original Unicode specification, which defined characters as fixed-width 16-bit entities.
zh_cn: char 数据类型（和 Character 对象封装的值）基于原始的 Unicode 规范，将字符定义为固定宽度的 16 位实体。

source: The compareAndSet method is not a general replacement for locking.
zh_cn: compareAndSet 方法不是锁的常规替换方法。

source: The double value that is closer than any other to e, the base of the natural logarithms.
zh_cn: 比任何其他值都更接近 e（即自然对数的底数）的 double 值。

source: The double value that is closer than any other to pi, the ratio of the circumference of a circle to its diameter.
zh_cn: 比任何其他值都更接近 pi（即圆的周长与直径之比）的 double 值。

source: The dstOffset argument must be greater than or equal to 0, and less than or equal to the length of this sequence.
zh_cn: dstOffset 参数必须大于等于 0，且小于等于此序列的长度。

source: The equals method for class Object implements the most discriminating possible equivalence relation on objects; that is, for any non-null reference values x and y, this method returns true if and only if x and y refer to the same object (x == y has the value true).
zh_cn: Object 类的 equals 方法实现对象上差别可能性最大的相等关系；即，对于任何非空引用值 x 和 y，当且仅当 x 和 y 引用同一个对象时，此方法才返回 true（x == y 具有值 true）。

source: The equals method implements an equivalence relation on non-null object references:
zh_cn: equals 方法在非空对象引用上实现相等关系：

source: The exit method of class Runtime has been called and the security manager has permitted the exit operation to take place.
zh_cn: 调用了 Runtime 类的 exit 方法，并且安全管理器允许退出操作发生。

source: The finalize method is never invoked more than once by a Java virtual machine for any given object.
zh_cn: 对于任何给定对象，Java 虚拟机最多只调用一次 finalize 方法。

source: The finalize method of class Object performs no special action; it simply returns normally.
zh_cn: Object 类的 finalize 方法执行非特殊性操作；它仅执行一些常规返回。

source: The forName method in class Class.
zh_cn: Class 类中的 forName 方法。

source: The int value representing the abstract modifier.
zh_cn: 表示 abstract 修饰符的 int 的值。

source: The int value representing the final modifier.
zh_cn: 表示 final 修饰符的 int 值。

source: The int value representing the interface modifier.
zh_cn: 表示 interface 修饰符的 int 的值。

source: The int value representing the native modifier.
zh_cn: 表示 native 修饰符的 int 的值。

source: The int value representing the private modifier.
zh_cn: 表示 private 修饰符的 int 值。

source: The int value representing the protected modifier.
zh_cn: 表示 protected 修饰符的 int 值。

source: The int value representing the public modifier.
zh_cn: 表示 public 修饰符的 int 值。

source: The int value representing the static modifier.
zh_cn: 表示 static 修饰符的 int 值。

source: The int value representing the strictfp modifier.
zh_cn: 表示 strictfp 修饰符的 int 的值。

source: The int value representing the synchronized modifier.
zh_cn: 表示 synchronized 修饰符的 int 值。

source: The int value representing the transient modifier.
zh_cn: 表示 transient 修饰符的 int 的值。

source: The int value representing the volatile modifier.
zh_cn: 表示 volatile 修饰符的 int 值。

source: The java.security.ProtectionDomain of a proxy class is the same as that of system classes loaded by the bootstrap class loader, such as java.lang.Object, because the code for a proxy class is generated by trusted system code.
zh_cn: 代理类的 java.security.ProtectionDomain 与由引导类加载器（如 java.lang.Object）加载的系统类相同，原因是代理类的代码由受信任的系统代码生成。

source: The minimumCapacity argument.
zh_cn: minimumCapacity 参数。

source: The newLength argument must be greater than or equal to 0.
zh_cn: newLength 参数必须大于等于 0。

source: The offset argument must be greater than or equal to 0, and less than or equal to the length of this sequence.
zh_cn: offset 参数必须大于等于 0，且小于等于此序列的长度。

source: The toString method for class Object returns a string consisting of the name of the class of which the object is an instance, the at-sign character `@', and the unsigned hexadecimal representation of the hash code of the object.
zh_cn: Object 类的 toString 方法返回一个字符串，该字符串由类名（对象是该类的一个实例）、at 标记符“@”和此对象哈希码的无符号十六进制表示组成。

source: The start() method creates a new Process instance with those attributes.
zh_cn: start() 方法利用这些属性创建一个新的 Process 实例。

source: The AbstractQueuedLongSynchronizer class provides the same functionality but extends support to 64 bits of synchronization state.
zh_cn: AbstractQueuedLongSynchronizer 类提供相同的功能但扩展了对同步状态的 64 位的支持。

source: The AtomicStampedReference class associates an integer value with a reference.
zh_cn: AtomicStampedReference 类将整数值与引用关联起来。

source: The ConcurrentLinkedDeque class is similar, but additionally supports the Deque interface.
zh_cn: 在 ConcurrentLinkedDeque 类是类似的，但附加地支持 Deque 接口。

source: The ThreadDeath error, though a "normal" condition, is also a subclass of Error because most applications should not try to catch it.
zh_cn: 虽然 ThreadDeath 错误是一个“正规”的条件，但它也是 Error 的子类，因为大多数应用程序都不应该试图捕获它。

source: The containsKey operation may be used to distinguish these two cases.
zh_cn: 可使用 containsKey 操作来区分这两种情况。

source: The append method always adds these characters at the end of the buffer; the insert method adds the characters at a specified point.
zh_cn: append 方法始终将这些字符添加到缓冲区的末端；而 insert 方法则在指定的点添加字符。

source: The append method always adds these characters at the end of the builder; the insert method adds the characters at a specified point.
zh_cn: append 方法始终将这些字符添加到生成器的末端；而 insert 方法则在指定的点添加字符。

source: The finalize method may take any action, including making this object available again to other threads; the usual purpose of finalize, however, is to perform cleanup actions before the object is irrevocably discarded.
zh_cn: finalize 方法可以采取任何操作，其中包括再次使此对象对其他线程可用；不过，finalize 的主要目的是在不可撤消地丢弃对象之前执行清除操作。

source: The synchronized and volatile constructs, as well as the Thread.start() and Thread.join() methods, can form happens-before relationships.
zh_cn: synchronized 和 volatile 构造 happen-before 关系，Thread.start() 和 Thread.join() 方法形成 happen-before 关系。

source: The Executors class provides factory methods for the most common kinds and configurations of Executors, as well as a few utility methods for using them.
zh_cn: Executors 类提供大多数 Executor 的常见类型和配置的工厂方法，以及使用它们的几种实用工具方法。

source: The start() method can be invoked repeatedly from the same instance to create new subprocesses with identical or related attributes.
zh_cn: start() 方法可以从同一实例重复调用，以利用相同的或相关的属性创建新的子进程。

source: The LockSupport class provides lower-level blocking and unblocking support that is useful for those developers implementing their own customized lock classes.
zh_cn: LockSupport 类提供了更低级别的阻塞和解除阻塞支持，这对那些实现自己的定制锁类的开发人员很有用。

source: The ScheduledExecutorService subinterface and associated interfaces add support for delayed and periodic task execution.
zh_cn: ScheduledExecutorService 子接口及相关的接口添加了对延迟的和定期任务执行的支持。

source: The Void class is a non-instantiable class that holds a reference to a Class object representing the type void.
zh_cn: Void 类是一个非实例化的类，它保持一个对表示基本类型 void 的 Class 对象的引用。

source: The interrupted status of the thread is unaffected by this method.
zh_cn: 线程的中断状态 不受该方法的影响。

source: The quotient for this total order is:
zh_cn: 此总的顺序的商 是：

source: The capacity is the number of buckets in the hash table, and the initial capacity is simply the capacity at the time the hash table is created.
zh_cn: 容量 是哈希表中桶的数量，初始容量只是哈希表在创建时的容量。

source: The load factor is a measure of how full the hash table is allowed to get before its capacity is automatically increased.
zh_cn: 加载因子 是哈希表在其容量自动增加之前可以达到多满的一种尺度。

source: The ClassLoader class uses a delegation model to search for classes and resources.
zh_cn: ClassLoader 类使用委托模型来搜索类和资源。

source: The Formattable interface must be implemented by any class that needs to perform custom formatting using the 's' conversion specifier of Formatter.
zh_cn: Formattable 接口必须通过需要执行自定义格式化（使用 Formatter 的 's' 转换说明符）的任何类来实现。

source: The java.nio package defines the buffer classes, which are used throughout the NIO APIs.
zh_cn: java.nio 包定义了缓冲区类，这些类用于所有 NIO API。

source: The Appendable interface must be implemented by any class whose instances are intended to receive formatted output from a Formatter.
zh_cn: 如果某个类的实例打算接收取自 Formatter 的格式化输出，那么该类必须实现 Appendable 接口。

source: The HashMap is created with default load factor (0.75) and an initial capacity sufficient to hold the mappings in the specified Map.
zh_cn: 所创建的 HashMap 具有默认加载因子 (0.75) 和足以容纳指定 Map 中映射关系的初始容量。

source: The StringBuilder class should generally be used in preference to this one, as it supports all of the same operations but it is faster, as it performs no synchronization.
zh_cn: 与该类相比，通常应该优先使用 StringBuilder 类，因为它支持所有相同的操作，但由于它不执行同步，所以速度更快。

source: The AccessibleObject class is the base class for Field, Method and Constructor objects.
zh_cn: AccessibleObject 类是 Field、Method 和 Constructor 对象的基类。

source: The Boolean class wraps a value of the primitive type boolean in an object.
zh_cn: Boolean 类将基本类型为 boolean 的值包装在一个对象中。

source: The Character Encoding is not supported.
zh_cn: 不支持字符编码。

source: The Class object representing the primitive type boolean.
zh_cn: 表示基本类型 boolean 的 Class 对象。

source: The Java Virtual Machine allows an application to have multiple threads of execution running concurrently.
zh_cn: Java 虚拟机允许应用程序并发地运行多个执行线程。

source: The Java Virtual Machine continues to execute threads until either of the following occurs:
zh_cn: Java 虚拟机会继续执行线程，直到下列任一情况出现时为止：

source: The Java Virtual Machine exits when the only threads running are all daemon threads.
zh_cn: 当正在运行的线程都是守护线程时，Java 虚拟机退出。

source: The Java language provides special support for the string concatenation operator ( + ), and for conversion of other objects to strings.
zh_cn: Java 语言提供对字符串串联符号（"+"）以及将其他对象转换为字符串的特殊支持。

source: The Java math library is defined with respect to fdlibm version 5.3.
zh_cn: Java 数学库是根据 fdlibm 5.3 版定义的。

source: The Java platform uses the UTF-16 representation in char arrays and in the String and StringBuffer classes.
zh_cn: Java 平台在 char 数组以及 String 和 StringBuffer 类中使用 UTF-16 表示形式。

source: The Java programming language does not guarantee which thread will invoke the finalize method for any given object.
zh_cn: Java 编程语言不保证哪个线程将调用某个给定对象的 finalize 方法。

source: The Key interface is the top-level interface for all keys.
zh_cn: Key 是所有密钥的顶层接口。

source: The KeyPairGenerator class is used to generate pairs of public and private keys.
zh_cn: KeyPairGenerator 类用于生成公钥和私钥对。

source: The Modifier class provides static methods and constants to decode class and member access modifiers.
zh_cn: Modifier 类提供了 static 方法和常量，对类和成员访问修饰符进行解码。

source: The Modifier class should be used to decode the modifiers in the integer.
zh_cn: 应该使用 Modifier 类解码整数中的修饰符。

source: The Signature class is used to provide applications the functionality of a digital signature algorithm.
zh_cn: Signature 类用来为应用程序提供数字签名算法功能。

source: The Unicode Standard has since been changed to allow for characters whose representation requires more than 16 bits.
zh_cn: Unicode 标准曾做过修改，以允许那些其表示形式需要超过 16 位的字符。

source: The abstract class ContentHandler is the superclass of all classes that read an Object from a URLConnection.
zh_cn: 抽象类 ContentHandler 是从 URLConnection 读取 Object 的所有类的超类。

source: The abstract class Number is the superclass of classes BigDecimal, BigInteger, Byte, Double, Float, Integer, Long, and Short.
zh_cn: 抽象类 Number 是 BigDecimal、BigInteger、Byte、Double、Float、Integer、Long 和 Short 类的超类。

source: The abstract class SocketImpl is a common superclass of all classes that actually implement sockets.
zh_cn: 抽象类 SocketImpl 是实际实现套接字的所有类的通用超类。

source: The abstract class URLConnection is the superclass of all classes that represent a communications link between the application and a URL.
zh_cn: 抽象类 URLConnection 是所有类的超类，它代表应用程序和 URL 之间的通信链接。

source: The abstract class URLStreamHandler is the common superclass for all stream protocol handlers.
zh_cn: 抽象类 URLStreamHandler 是所有流协议处理程序的通用超类。

source: The access checks--for public, default (package) access, protected, and private members--are performed when Fields, Methods or Constructors are used to set or get fields, to invoke methods, or to create and initialize new instances of classes, respectively.
zh_cn: 对于公共成员、默认（打包）访问成员、受保护成员和私有成员，在分别使用 Field、Method 或 Constructor 对象来设置或获取字段、调用方法，或者创建和初始化类的新实例的时候，会执行访问检查。

source: The action to be performed for each entry
zh_cn: 为每个条目执行的操作

source: The added complexity of tree bins is worthwhile in providing worst-case O(log n) operations when keys either have distinct hashes or are orderable, Thus, performance degrades gracefully under accidental or malicious usages in which hashCode() methods return values that are poorly distributed, as well as those in which many keys share a hashCode, so long as they are also Comparable.
zh_cn: tree bins 所增加的复杂度是值得的，当 keys 具有不同的哈希或者可排序时，都提供最坏 O(log n) 的操作。因此，在无意或有意的使用中，如果 hashCode() 返回的值分布不均，或者多个 key 共享一个 hashCode，只要它们是 Comparable，性能的下降也会平滑。

source: The amount of real time, measured in nanoseconds, is given by:
zh_cn: 用毫微秒度量的实际时间量可以通过以下公式计算出来：

source: The annotation type java.lang.annotation.Repeatable is used to indicate that the annotation type whose declaration it (meta-)annotates is repeatable.
zh_cn: 注释类型 java.lang.annotation.Repeatable 用于指示注释类型，其声明它(元)注释是 repeatable (可重复的)。

source: The argument is appended to the contents of this sequence.
zh_cn: 参数将被追加到此序列。

source: The argument may be null -- this means to use the working directory of the current Java process, usually the directory named by the system property user.dir, as the working directory of the child process.
zh_cn: 参数可以为 null，这意味着要使用当前 Java 进程的工作目录，通常是由系统属性 user.dir 指定的目录作为子进程的工作目录。

source: The atomic classes also support method weakCompareAndSet, which has limited applicability.
zh_cn: 原子类也支持 weakCompareAndSet 方法，该方法具有受限制的适用性。
